{
  "filename": "mots-c-nad-ss31.mp3",
  "timestamp": "2026-02-03T11:03:28.762893",
  "word_count": 7209,
  "duration_estimate": "~48 min",
  "transcript": "So I almost wasn't going to do this podcast, but I actually thank you for the questions.\nKeep them coming.\nAnd I'll do my best to make podcasts and posts and answer things like that.\nAnd if you leave me a question in my ask me your questions posts that I make generally\nabout once a week, I'll do my best to get to it.\nI usually get somewhere in the neighborhood of about 10 to 15,000 questions.\nAnd I appreciate that.\nI appreciate the trust.\nI'll give you all I got.\nAnd I have a ton of answers, just single Q&A answers on Rumble.\nAnd you guys should all, if you're not following me on Rumble and you're not subscribed, you\nshould for two reasons.\nOne, honestly, because I'm asking you to, and it's the safest place.\nIt's better than YouTube, this crap that I'm on and better than social media for in general.\nSo today, NAD plus, actually MOTC, NAD plus and SS31 as a mitochondrial repair.\nOkay.\nI hate to say the word protocol because it's so much more than that.\nIt's like a repair blueprint.\nYour mitochondria, your life.\nListen, all of you guys are sick.\nJust understand, you're all sick.\nAnd you might not be sick enough for a diagnosis, not yet, but you're tired.\nYour brain is foggy and you can't lose the last 20 or 30 pounds, no matter how you eat\nor how hard you work out or how long you fast or how many walks you go on or the water fasts\nor whatever it is you guys are doing and your joints ache.\nAnd your doctor runs the standard panel, right?\nA CBC and goes, you're all within normal limits, right?\nWNL, which is BS, by the way, just so you know.\nAnd maybe they say your cholesterol is high or your blood pressure is creeping up.\nAnd then they give you the, it's just age.\nHere's a prescription.\nWe're going to check again in three, two, one, six months.\nIt's always the same standard.\nAnd yet the reason that I can say this with all confidence, knowing that's what happens\nis because that's what happens.\nAnd a lot of you guys that join the black card, I love that you're with me because I'm giving\nyou real health care, real health advice.\nAnd I'll bleed for my black.\nThere's a reason because I want you to have the answers.\nSo like I said, you want to join the black card, apply at unlockthecard.com.\nIf somebody sent me a mail, oh, I thought it was free.\nIt's not free.\nIt's not free.\nIt's still, it hasn't changed yet.\nSo it's still last year's price briefly, which is 10 grand versus 25 grand.\nIt's wire only.\nAnd you get access to my live Q and a call I do every Monday in the black card.\nAnd you get the VIP community, you get protocols, you get direct access to me to actually answer\nyour questions.\nAnd you get to be part of one hell of a group.\nReally?\nMy, my black card people are hands down my favorite people in the communities I've built.\nI just love the hell out of these people and their family.\nWe're going to do a big black card meetup.\nIt's going to be awesome this year.\nAnd just to hang out, meet, greet, hang out, eat some really good food, probably do something\ntogether.\nI don't, I'm not going to be one of these.\nWe're going to work out in the morning and then we're going to have this seminar and\nno, we're not going to do that.\nWe're just going to have a really good time and it's going to be a ton of fun.\nI don't know, maybe rent a bunch of quads or side-by-sides and go tear up some sand dunes\nor do it in the winter and just go snowmobiling throughout the day.\nI don't know.\nI just want to do something fun.\nSo if you guys are in my black crew or my black card crew, by the way, throw ideas at\nme, I'm open and it's going to be a banger of a good time.\nBut anyway, that's not what this is about.\nSo MOTC, NAD plus and SS31, as far as mitochondrial repair is concerned and all the nonsense I talked\nabout, about like the blood pressure, like I said, and all the stuff, Hey, it's just age.\nHere's a prescription.\nLet me translate what all that means for you.\nThat nonsense that comes out of your doctor's mouth.\nWhat they're really saying is your body's failing.\nWe don't know why we don't care why our job is to manage the failure to slow the slide.\nWelcome to the decline.\nDon't worry.\nWe will treat you as a product because that's what you are.\nIt's a lie.\nIt's a profitable multi-trillion dollar lie.\nAnd you guys, please, you guys are buying it because modern medicine is not built to\nsolve problems.\nIt's built to manage customers.\nIt's a subscription service for your own decay.\nIt bugs me.\nA beta blocker for your heart that we're too lazy to fix because we don't want to do it.\nSSRI for the brain because we're too ignorant to fuel it.\nMetformin for your insulin resistance, your diabetes, your metabolic syndrome, because\nwe're too arrogant to understand physiology because we aren't going to medical school to\nbecome actual doctors.\nWe're going to medical school to become trades people, pharmaceutical reps.\nAnd if you think I'm wrong, look around.\nAnd if you're a doctor and that offends you, I don't care.\nI've been a doctor probably longer than you.\nAnd I've seen this.\nAnd the decline of the medical system is embarrassing.\nSo I'm out here solving every health issue you've got for free.\nAnd like I said, you want to join the black card?\nGreat.\nYou want to buy from Elite Biogenics?\nGreat.\nYou don't still come out here and do it.\nI am past a year now.\nI've been doing this for longer than a year every day.\nWe're treating symptoms and we're putting a bandaid on just a hemorrhaging wound and they\nrun around with the arrogance to call it a cure.\nThat's what we do as medical professionals.\nI refuse to do that.\nFor all of you guys, all of you Insta bros and you want to be science people copying my\nstuff.\nHow about you give me some fucking credit for it?\nBecause I spend 16 hour days working my face off for everybody, not for you to run around\nand steal my stuff.\nAnd then what?\nTry and take credit for it and think that you actually did the work.\nYou haven't done any of the work.\nYou haven't done any of the work.\nAnd that's what embarrasses me.\nI'm looking up at the screen, by the way, because what happened was Riverside yet again,\nin all its infinite wisdom, decided to turn off a track and then start a new one.\nWhy?\nBecause Riverside FM sucks, but I keep using it because it's the best one in the game and\nthey know it.\nAnd that's the problem.\nIf you are a, whoever you are that runs Riverside, you happen to hear this.\nYou know what?\nYou need to fix your system because it blows.\nAnyway, I got that off my chest.\nMy rant and my whining, never condemn, criticize or complain.\nAnd I did all three just now.\nI need to read Dale Carnegie, how to win friends and influence people maybe one more time today,\nbecause today I'm feeling I'm in that kind of mood.\nLet's wonder.\nIt's amazing.\nThe entitlement that people have right now.\nI have people, this is my favorite, people that didn't pay for something who want access\nto something because they feel they should get something yet haven't done anything that\nI've ever given me since.\nIt hasn't.\nYou're not gonna.\nYou never will.\nIt's like most people don't read past the first chapter in a book because they placate\nthemselves going, it's on the shelf if I ever need it.\nAnd they do that until they get to the end of their life.\nAnd then they go, I never did anything with it.\nYour life is going to end.\nYou should do everything you can to max it out.\nThat's why I'm telling you how to fix your mitochondria.\nBecause remember, three biological failures, systemic inflammation, insulin resistance,\nand ATP shortage.\nBut systemic inflammation and insulin resistance cause the ATP shortage because it's broken\nmitochondria.\nThey all work together in a wonderful, glorious harmony to destroy your physiology.\nSo what if I told you that, listen, every single one of these diseases from heart failure that\nkills your grandfather, your grandmother, to the Alzheimer's, the dementia that steals your\nmom's mind, that destroyed Bruce Willis where the doctors did nothing for all of you doctors\nthat were on the Bruce Willis team.\nI hope you get eye cancer.\nYou're a terrible human being because you took that guy and you let him suffer and you did\nnothing to solve it.\nI'll say it again.\nI'll take it to my grave.\nI could have helped him.\nI could have reversed it.\nYou know, from the cancer that terrifies you to the simple grinding fatigue that robs you\nof your life.\nThey all share a single common point of failure.\nIt's not your genes.\nIt's not your history.\nIt's not hereditary.\nIt's not bad luck.\nIt is your mitochondria.\nAnd if you understand how, what is about to occur in this episode, just if you understand\neverything I'm about to give you, you're going to understand more about your health than 99%\nof the doctors in this country.\nAnd I hope that insults the doctors because you know nothing and it's embarrassing.\nYou should know everything and help everybody and teach them all.\nThe mitochondria are not, they're not powerhouses of the cell.\nThis is the, I got to get this off my chest because it's bugging me.\nI'm in one of these moods today.\nThat is a kindergarten simplification.\nIt's like calling a nuclear reactor, a hot frigging rock.\nIt's an insult to one of the most sophisticated biological structures in existence.\nMitochondria are these ancient aliens living inside you.\nThis primitive cell swallowed a bacterium.\nAnd instead of digesting it, they made a deal.\nThey grabbed their hands and they shook them.\nAnd the bacterium said, I'll give you energy.\nA thousand times more energy than you could ever possibly make on your own.\nAnd the cell said, okay, I tell you what, in exchange for that,\nI will give you shelter and replication machinery.\nSo you can do this over and over again.\nThat symbiotic merger is the reason that you are not a puddle of crap every single day.\nIt's the reason that complex life exists and that all your systems actually work\nbecause every one of the 37 trillion cells in your body,\nwith the pathetic exception, honestly, of your red, your RBCs,\nyour red blood cells is inhabited by hundreds to thousands of these little primordial power plants.\nBut they are not just energy producers.\nThey're CPU, central processing unit of your cell.\nThey're the arbiters of life and death.\nI've called them this before.\nThey hold the keys to apoptosis, which is programmed cell suicide.\nThey regulate cellular metabolism, redox signaling, calcium balance.\nThey're the command center.\nAnd when the command center goes tits up, the entire operation collapses.\nIt's not complicated.\nIt's really not.\nPlease just trust me on this.\nLike this one guy all the time.\nLet me dumb down Dr. Trevor Bachmeier.\nYou're stealing my stuff.\nWhy don't you just say you're stealing my stuff?\nBecause not once has that Muppet ever given me credit.\nAnd yet I'm a pretty unique looking dude.\nEverybody knows who I am now.\nWhy?\nBecause I get phone calls and emails and people asking me for help because I actually understand it.\nDo you know why I'm out here every day?\nBecause I have the knowledge.\nIt's my obligation to give it to you.\nIt's my duty.\nIt's my duty to give you every single ounce of what I've learned.\nIt's not my duty to hoard it or gatekeep it or tell you I'll tell you the rest of it.\nIf you sign up for my program or you buy my stuff, it's not my duty to sit there and go, I'll give you an affiliate code.\nAnd if you bring me this, I'll do that for you.\nIt is to give you the information so you can make an informed decision.\nSo you have a better life.\nSo all of you jackasses out there stealing my stuff and making videos about my stuff and making reaction videos or dumbing down Dr. Trevor Bachmeyer.\nNumber one, I've forgotten more than you'll ever learn.\nI am smarter than you.\nIt's not an arrogant statement.\nIt's because I do the work to become smarter and more intelligent than you.\nBut how about you give me some damn credit for the videos that I've done all the work for?\nBecause listen, you don't even, you don't even do it.\nPeople don't, I get you guys stealing my research all the time.\nYou haven't done any.\nThere's a guy in my group.\nHis name's Josh.\nHe's a stud.\nThis guy's a nurse practitioner, solid dude.\nLove the guy.\nEven he was sending me research going, holy crap, man.\nIt is unbelievable.\nBasically how much research you put together and give out.\nHow do you find it?\nBecause there's three different ways of the same research and different studies.\nIt's incredibly complicated.\nI'm so blown away at how you find it.\nHe gets it.\nYou have no idea how hard I work for you guys because you haven't had the discipline\nto do the work.\nAnd yes, it pisses me off.\nI told you, and this is the mood I'm in.\nSo if you don't like it, it's my house.\nIf one person listens or 1 million people listen, when a mitochondria fails, you get sick.\nWhen they fail catastrophically, you get dead.\n2018 review in cell hallmarks of aging specifically places mitochondrial dysfunction at the very center\nof the diagram.\nIt's not a symptom.\nIt's not a symptom.\nIt's not a lack of something.\nIt's a cause.\nSo listen, you got to ask, why are they the most important piece of your physiology?\nBecause life is a transaction paid for in a single currency.\nThe currency, adenosine, triphosphate, ATP.\nWithout ATP, nothing happens.\nYou can't sell your money.\nYou can't wire it.\nYou can't work out.\nYou can't drive the car.\nYou can't kiss the girl, have sex with the girl, build the house, get the job, mow the\nlawn.\nYou can't do.\nYou can't have a thought.\nYou can't dream.\nYou can't sleep.\nYour heart doesn't beat.\nNothing works.\nYour heart is a pump that requires ATP for every contraction.\nYour neurons are bioelectrical wires that require ATP to fire.\nEvery cellular repair, every thought, every heartbeat is an ATP transaction.\nYou guys need to understand this.\nmitochondria produce over 90% of the body's ATP through a process called oxidative phosphorylation.\nIt's the most efficient, hands down, efficient energy production system on earth.\nBut when the demand for ATP exceeds, outstrips the supply, when you have a systemic energy\nbankruptcy, the body starts making brutal triage decisions.\nIt's like a city during a, you remember rolling blackouts.\nSo in California, we used to have these brownouts and blackouts all the time because allegedly\nthey didn't have any power.\nBS.\nYou and I both know that.\nEverybody knows that.\nAnd if you go, it's not true.\nI lived in California.\nSo did I, dumbass.\nIt's like a city during a rolling blackout.\nThe hospitals and the police stations, listen to me.\nThis is why you have to understand this.\nThe hospitals and the police stations get the last drops of power.\nGet them all, right?\nThe suburbs go dark.\nIn your body, the suburbs are non-essential repair, immune surveillance, and higher cognitive\nfunction.\nJust burn that into your head.\nYou stop repairing collagen.\nSo your skin sags and your joints hurt.\nYou dial back immune vigilance.\nSo you get sick much more often.\nYou throttle cognitive function.\nSo you get slow thinking and brain fog.\nThis isn't aging the way you're being sold this dumb idea.\nThis is managed energy failure.\nYou guys, this leads directly 100% to my model of the three biological failures that underpin\nevery single chronic disease on earth.\nThis model is the key to understanding why you're sick, by the way.\nIf you actually, like, where's my Nobel prize?\nAnd people get really mad when they say, you didn't, you don't deserve.\nYou think one plus one is orange.\nI think I deserve one because I solved health.\nAnd you know, what's funny is somebody goes, that's a really ignorant statement.\nNo, it's not.\nIt's a factual statement because I solved all health problems on the planet.\nEvery one of them.\nI solved all three.\nOr I solved one by solving all three problems, the biological failures.\nYou have to understand that.\nI don't come out here because I want to brag.\nI come out here because I want to help.\nLook at, just follow me.\nSystemic inflammation.\nThis is a constant, low-grade fire throughout your entire body.\nAnd it is fueled by the standard American stupidity diet, chronic stress, and environmental\ntoxins.\nAnd the last one's my favorite, gut dysbiosis.\nThis inflammatory cytokine storm, measured by things like C-reactive protein, IL-6, TNF-alpha,\ndoes something pretty sinister, directly attacks the mitochondria.\nThat's what I was saying at the beginning.\nIt damages the very delicate inner mitochondrial membrane and mutates the mitochondrial DNA.\n2015, nature reviews in immunology.\nThey actually detailed it step by step.\nHow TNF-alpha, which is a major inflammatory cytokine, directly inhibits the ETC.\nETC, the electron transport chain, which is what spits out adenosine triphosphate.\nWhen it inhibits the ETC, it chokes off ATP production right at the source.\nInflammation, listen to me.\nInflammation is the arsonist that's setting fire to the power plant that you desperately\nneed for life.\nFailure two, insulin resistance.\nThis is when your cells become completely deaf, right?\nThey can't hear it, to the hormone insulin.\nInsulin is that key that comes in and unlocks the cell door to let glucose come flooding\nin.\nGlucose is the primary, incredibly high octane.\nIt's like jet fuel, right?\nHigh octane fuel for your mitochondria.\nWhen the cells resist insulin, they don't recognize that the glucose stays in your blood\nstreet.\nYou got blood, your blood's full of sugar.\nAnd when the mitochondria starve, this is like having a convoy of fuel trucks stuck in\ntraffic right outside the power plant while the generators sputter and run on fumes and\nthen finally die off.\n2017, Journal of Clinical Investigations proved, listen to me, proved that mitochondria\ndysfunction in muscle tissue is the, not a, the primary driver of insulin resistance.\nIt's not a consequence, you guys, that they want you to think the other thing.\nYou have the science books.\nYou build the sciences.\nIt's just wrong.\nIt's wrong.\nIt's that simple.\nIt's a vicious cycle.\nBad mitochondria cause insulin resistance, which starves the mitochondria, which makes\nthem worse.\nAnd these two failures cause the inevitable, predictable failure.\nThree.\nThey created ATP shortage.\nIt's an energy crisis of epic proportions in your physiology.\nYou guys, this is not, listen, it's not a standalone event.\nIt's the direct mathematical consequence of the first two failures.\nThe fire, right?\nThe inflammation has damaged the machinery.\nAnd then the fuel line insulin signaling is clogged.\nThe result is a power outage.\nEvery diagnosed disease that we see is a manifestation of this energy bankruptcy in a specific tissue.\nI'll prove it.\nAlzheimer's, ATP shortage in the hippocampus.\nHeart failure, ATP shortage in the cardiac muscle.\nCancer, a corrupted alternative, right?\nWarburg effect, glycolysis, alternative energy pathway born from, wait for it, failed mitochondria.\nYou're trying to solve the energy crisis by giving the city council more money.\nDrugs, right?\nYou're just dumping more cash in.\nThat doesn't help anybody.\nInstead of putting out the damn fire, clearing the roads and repairing the generators.\nTherefore, mitochondrial repair isn't an option.\nIt's the only logical first line defense.\nIt's the foundation for every single thing that's going to happen on this earth in your\nphysiology, in your little micro world.\nSo listen, how do we repair them?\nThat's the question now.\nOkay, fine.\nYou talked a lot, doc.\nHow do we repair it?\nOkay.\nNot with drugs that paper over symptoms.\nWe fix them surgically at the molecular level by addressing the three core pathologies of\nsick mitochondria.\nThis goes a little deeper.\nSo buckle up.\nAnd if you have to go to the, I got a dumbed down Dr. Trevor Bachmeier guy, he's just stealing\nmy stuff.\nSo he gets clicks.\nOkay.\nHe's got a TRT clinic.\nHe's an idiot.\nThree failures of the mitochondrion.\nFaulty programming.\nI went over these yesterday in my Instagram post.\nFaulty programming.\nSo it's running on the wrong software.\nIt's a fuel shortage has no raw materials.\nFollow me.\nCause this is really important to stay with me.\nAnd then structural decay.\nThe physical machinery itself is trashed.\nIt's broken.\nIt's running with pieces of sprockets are all broken.\nRight?\nSo this brings you to the trifecta, the three compounds that it's a paradigm shift.\nMod C, NAD plus, and SS 31.\nThis is why you need to understand this stuff.\nThis is not a supplementation.\nThis is bioengineering of your biology.\nYou guys, this isn't for me.\nIt's for you.\nLook at Mod C.\nLet's just go this.\nThis is Mod C.\nConsider it a, it's like a programming engineer.\nIt's like the ultimate prompt writer.\nRight?\nCause that's what people do.\nThere's actually careers, prompt writers.\nSome of the things you guys do are nuts.\nIt's so far beyond me.\nI'm going to be very transparent.\nIt's wild what you guys do.\nSo for decades, we were arrogant.\nWe thought the important instructions for life were in the nuclear DNA, right?\nThe center, the holy genome, right?\nWe're sequencing genome wrong.\n2015 university of Southern California discovered something that should have made the front page\nof every single newspaper in the world should be all over the internet.\nAnd I guarantee you, none of you guys have heard this.\nThey found this peptide, small string of like 16 amino acids encoded, not in the nucleus,\nbut in the DNA inside the mitochondria.\nThey called it Mod C.\nMitochondrial derived peptide.\nThis changes everything.\nIt means the mitochondria have their own hormonal signaling system.\nMod C is a messenger.\nWhen your body is under metabolic stress.\nSo when you're drowning in sugar and sitting on your ass, Mod C is released.\nTravels to the nucleus.\nInteracts with key pathways.\nAnd then activates AMPK.\nIt's the cell's master energy sensor.\nInteracts with the aryl hydrocarbon receptor.\nIts primary job is to reprogram the cell's metabolism away from inefficient inflammatory\nglucose burning and towards efficient fatty acid oxidation.\nIt is a master key for the one thing that is causing a whole host of problems in your physiology.\nInsulin sensitivity or insulin resistance, which needs to be turned into insulin sensitivity.\nAnd the diet, the data is, it's obscene.\nIt's staggering.\n2019 Nature Communications gave Mod C.\nListen to this.\nThis is wild.\nGave Mod C to mice on a high fat American style diet.\nAnd the results, it completely prevented diet-induced obesity and insulin resistance.\nThe treated mice ate the same garbage, but stayed lean and metabolically healthy.\nThe control group, the control mice they used became fat, imbecilic, and diabetic,\nlike a lot of the population right now.\nMod C doesn't just manage the problem, you guys.\nIt fixes the programming area that caused it.\nThat's the error.\nIt's not the diet.\nIt's the issue is so much further than that.\nIt attacks failure too, right?\nFailure too.\nInsulin resistance.\nAnd it punches it in the face.\nIt gives it the old Mike Tyson.\nLook at the second part of this.\nNAD plus.\nThis is the rocket fuel.\nRemember what I said, right?\nThere's three failures.\nSo we have programming, wrong software, fuel problem, machinery breakdown.\nThis is mitochondria, right?\nNot my three biological failures.\nThis is a result of the three biological.\nAnd I hope you're getting the hang of this, man, because this is me, baby.\nThis is all me.\nNAD plus.\nNicotinamide adenine dinucleotide.\nThis is big, fancy words.\nDoesn't matter.\nThis isn't just a molecule.\nIt's like the spark plug and the fuel line all at the same time.\nNAD plus is a coenzyme.\nA shuttle bus.\nAnd I explained this very well for electrons in the mitochondria.\nIt's absolutely essential for the ETC, the electron transport chain, the final stage of\nATP production.\nNo way, no NAD plus can't do it without NAD plus here.\nThe chain grinds to a halt.\nIt doesn't work.\nNo electrons, no proton gradient, no ATP synthase spool up, no turbine, nothing.\nIt doesn't work.\nIt's also the primary driver for sirtuins, by the way, which is a family of proteins\nthat are like the mechanics and QC quality control team for your entire DNA.\nAnd here's the crisis.\nNAD plus levels tank.\nI'm 52.\nI'm going to be 53 in less than three months.\nWhen you age, NAD plus levels tank as you grow older.\nSo by the time you're 50, so around my age, you might have at the most half the NAD plus\nyou had when you were 20.\nWhy?\nPartly because of this enzyme called CD38, which just, it's like throwing NAD plus into\na wood chipper.\nJust choose it up.\nIt becomes more active with inflammation.\nThat makes it even worse.\nDo you see how this is all connected now?\nSo failure one inflammation directly causes a shortage of NAD plus.\nIt's this catastrophic feedback loop.\nNow do you see how this gets married together?\nThere's this research.\nOkay.\nThis guy, David Sinclair at Harvard.\nThis is legendary.\nThat's how wild this research is.\n2018 paper and cell.\nThey restored NAD plus levels in old mice.\nAnd the result, the mitochondria in their muscles and all their other tissues rejuvenated.\nThe mice's endurance doubled.\nTheir vascular health reversed to that of incredibly young mice.\nThey didn't just slow aging.\nThey reversed key markers of it.\nBoosting NAD plus is like pouring high octane fuel into an engine that's starving for fuel\nthat needs the best of the best.\nAnd then it gets the spark back.\nIt solves the fuel problem.\nThat's how this stuff works.\nIf you don't get that, please go back and listen to this part again.\nThe third one.\nAnd by the way, the hierarchy matters.\nI'm tired of these Insta bros going out there and going, it doesn't matter.\nYou should do this.\nStop it.\nI don't care if you're a doctor.\nI don't care if you have all the PhDs after your name.\nIt doesn't make a difference.\nYou're still wrong.\nI'm giving you the information, not because I'm trying to sell you my stuff.\nDo you ever notice that?\nI'm not out here walking my stuff going, hey, let me tell you, I'll get this secret way to\nget it.\nI see this one guy.\nHe's talking about Reddit, True Tide.\nI love when people go, it's called retatretide.\nShut up.\nNo, it's not.\nThe third one.\nI could do this all day.\nIt's like I told you, I'm in a mood.\nSS31.\nThis is the structural engineer of this entire thing.\nOkay.\nThis is the, it's like a sniper, not a shotgun, not a scattergun.\nThe inner mitochondrial membrane is where the electrical magic happens.\nOkay.\nIt needs to maintain a strong electrical chart, membrane potential to force.\nThis is what it's called in order to force protons through.\nThis is the turbine, right?\nThe ATP synthase turbine and generate power.\nWith age and disease, this membrane gets, it gets beat up.\nIt gets hole shot in it.\nIt becomes leaky.\nReactive oxygen species, the exhaust fumes of energy production.\nThey scorch the very delicate lipid membranes and the charge dissipates.\nThat's the problem, right?\nThe charge dissipates.\nSo the engine seizes, it can't do its job.\nNo ATP synthase, nothing.\nSS31 is a genius piece of chemical engineering.\nIt is a very small synthetic peptide with an incredibly unique property.\nCheck this out.\nIt has a positive charge and it loves fat.\nSo it's like a fat, happy person.\nThis means though it's electromagnetically drawn to and integrates directly into the negatively\ncharged fatty inner mitochondrial membrane.\nOnce it's there, it acts like a shield.\nIt scavenges up all those destructive ROSs, right?\nReactive oxygen species right at the source, preventing them from causing lipid peroxidation.\nTrust me.\nOkay.\nWhich now let me explain what that is.\nCause you're not the burning of the membrane is basically what it means.\nStabilizes the structure and then restores the one thing I said gets destroyed because\nit loses the charge dissipates the membrane potential, which is important for proton gradient\nand ATP synthase and all the things that need to occur.\nAnd the clinical evidence of this entire procedure is astounding.\n2017 journal of the American heart association of all things gave SS 31 after a heart attack\nafter, and the result phenomenal reduction in the size of tissue death and improvement in\nmitochondrial function in the surviving heart muscle.\nSolved two problems.\nSo they're protecting the power plants during a catastrophe.\nSS 31 also fixes the physical damage.\nImagine this is just another aspect to this.\nJust so you understand how these marry together.\nImagine SS 31 and TB 500 for myocardial damage to heal the myocardium.\nImagine how that would work.\nIf you take TB 500, which is proven to reverse fibrosis and solve damage to the\nmitochondria and you add SS 31, imagine what kind of wild stuff you could have that wouldn't\ncost you your heart or all the medication that they want to give you.\nYou guys need to start taking the thousand foot view on your health.\nPlease look at this.\nIsn't.\nAnd by the way, this isn't one of these take three pills a day situations.\nThis is a tactical strike on your failing mitochondria.\nYou don't send in infantry and air force and engineers all at the same time in some chaotic\nheap.\nYou have to have a sequence.\nThe hierarchy matters.\nYou start with the programmers and the fuel.\nMOTC and NAD+.\nYou run these together.\nOkay.\nEvery, I'm really hesitant to even do this part.\nRun these together every second day.\nAnd why this sequence?\nBecause you're setting up a new efficient OS operating system.\nMOTC is the software update that tells the cell to become this fat burning insulin sensitive\nmachine.\nNAD+.\nNAD+.\nIs the power surge that boots up the new system.\nSo you're creating conditions for high performance energy production.\nFollow.\nI felt like saying savvy, right?\nJust too much pirates of the Caribbean.\nNow, after a few weeks, let's say hypothetically for your kangaroo.\nOnce the new metabolic programming is installed and the energy flow is normalized.\nNow you deploy the structural engineer.\nYou add SS 31.\nI would hypothetically give it to my kangaroo every single day.\nThis is critical.\nYou don't fix, listen to me, you don't fix.\nStop getting my comments and arguing about this.\nI'm still right.\nWhether you get, I've never read any of your comments.\nJust so you know, you guys talk to yourselves because I'm not going to sit there and go argue\nwith stupidity who wants to sit there and complain or go some Insta bro says this,\nor some scientist says that, or this bodybuilder says this.\nI don't care.\nI'm still right because I know the system.\nI know physiology.\nI know biology.\nI know biochemistry.\nAnd I know how this works and why I know why this works, which is why people join my black\ncard because they go, this guy understands.\nYes, I do.\nAnd I actually care.\nWhere have I done all kinds of crazy marketing in this podcast?\nI'll help you out at the beginning.\nAnd it wasn't even marketing.\nI just went join or don't join.\nYou want to join apply at unlock the card.com and say here, I need the wire information so\nI can send you 10 grand.\nIf not, don't join.\nIf you didn't catch that, I still on sale, baby.\nSo listen, you add the SS 31 every day because you cannot fix the crack foundations of a factory\nwhile it's running outdated, inefficient machinery at full throttle.\nYou upgrade the software and the power supply first.\nThen once the new efficient system is humming the software, remember you're not doing hardware.\nYou guys are thinking hardware, but I'm talking software.\nSo get this because you're not, you can't install new software on something.\nYou have to do it this way.\nYou send in the engineers to reinforce the walls.\nSo the whole thing doesn't disintegrate under a new significantly higher load that you have\njust decided to take.\nIf you do it the other way around, you cause problems.\nThe energy or the synergy rather is mathematical.\nMOTC plus NAD plus equals optimized system.\nMOTC plus NAD plus then plus SS 31 optimized, robust, and fortified system.\nLook at how this is designed.\nThe protocol directly addressed, by the way, this is what hurts.\nOkay.\nThe protocol directly addresses the five most common lies of modern medicine conditions\nlabeled as diseases.\nI'll prove it when they're merely symptoms of mitochondrial failure.\nLook at CFS and CFS.\nBy the way, somebody asked me, they're like, Hey bro, I think they asked for chronic fatigue\nsyndrome, not fibromyalgia.\nThey're married and it's the identical thing.\nJust so you know, they're the identical thing.\nSo chronic fatigue syndrome and fibromyalgia.\nIt's not mysterious pain and tiredness with a couple of trigger points all over your back.\nIt's systemic ATP shortage.\nThe body has triaged energy away from muscle repair and CNS function, right?\nCentral nervous system function.\nLook at type two diabetes.\nIt's not a disease of blood sugar.\nIt's a disease of mitochondrial failure in the liver and muscle cells.\nThe mitochondria are so damaged that they can't utilize fuel property causing insulin resistance\nas a downstream effect.\nLook at Alzheimer's and Parkinson's and dementia.\nAll of the multiple sclerosis, all of them.\nThe brain consumes 20% of your body's energy, but is only 2% of its weight.\nSo this is a big deal because it's an energy greedy bitch is what it is.\nWhen neuronal mitochondria fail, these energy hungry cells are the first line to die.\nThey're the infantry right at the beginning that just get taken out by the tanks.\nNature study in nature.\nNeuroscience showed mitochondrial dysfunction precedes plaque formation in Alzheimer's,\ndementia by years, if not decade.\nYou need to hear what I just said.\nIf you don't solve this now, the problem is going to show up later, but you're going to\nhave a tombstone sitting there, which is the result of the problem.\nIt's not the problem.\nAnd they're going to still try and treat the problem.\nLook at cardiovascular disease.\nThe heart has the highest mitochondrial density of any organ in the body.\nAtherosclerosis is now understood and proven by the way, to be driven by mitochondrial\ndysfunction in the endothelial cells lining the arteries, right?\nI explained this, the whole foam cells, all of this stuff.\nI explained all of this on my atherosclerosis video.\nThey proved it, by the way, just so you know, when 2020 circulation research paper proved\nthis beyond a shadow of a doubt.\nAging.\nHow about aging?\nThis is number five, by the way, if you're keeping track.\nAging.\nI can do this all day.\nIt's not a time dependent mystery.\nIt is.\nHow did we populate the planet then?\nIf we needed all these drugs before?\nNo, we didn't.\nAnd if you go, oh, that's right.\nWe didn't need the peptides either.\nYou are repairing the system.\nA peptide is a signal.\nA drug is a wrecking ball.\nI'm not saying they're not needed if it's going to save your life, but 99% of the time,\nthey're not saving your life.\nThey're prolonging your life to make you a product.\nSo you're profitable.\nGet it through your head.\nAging is not this time dependent, like weird phenomenon.\nIt is the cumulative sum of mitochondrial decay across all 37 trillion cells in your body.\nThe mitochondrial theory of aging is the most robust L supported explanation we've got.\nLook it up.\nDon't take my word for it, baby.\nLook it up.\nNow watch.\nApply this.\nLet me show you how this entire magic stack actually solves all of these very incurable\ndiseases, Dr. Trevor.\nCardiovascular disease.\nWatch.\nMOTC reprograms the cardiac metabolism to be more efficient.\nNAD plus fuels the cardiomyocytes, making each contraction much more powerful, much more\nresilient.\nSS31 directly protects the mitochondrial membranes during periods of ischemia and dangerous\nand hypoxia, preventing cell death.\nYou're not thinning blood.\nYou're making the heart muscle much more indestructible.\nHow about neurological disease?\nLook at neurological.\nI could do this with throw anything at me.\nBoosting NAD plus is like giving your brain a quadruple here.\nHold up my coffee.\nQuadruple espresso.\nIt restores energy to neurons, preventing atrophy, improving synaptic function.\nMOTC improves the insulin sensitivity in your brain, which is crucial for memory formation.\nAnd SS31 protects the neurons from the oxidative stress that leads to the characteristic\nplaques, amyloid plaques, tau tangles.\nYou're not managing symptoms.\nYou're preventing the cell death that caused them in the first place.\nLook at aging.\nThis protocol that I just talked about, right?\nMOTC NAD plus SS31.\nIt's a direct assault on every single aspect of aging.\nIt counters genomic instability by fueling DNA repair via NAD plus and those magic proteins\nI talked about called sirtuins.\nIt addresses epigenetic alterations through metabolic programming.\nMOTC.\nAnd it directly reverses mitochondrial dysfunction.\nAll three.\nYou're not slowing aging.\nYou're reversing the biomarkers of aging at a cellular level.\nLook at cancer.\nYou want to go really hard into the pain?\nLook at cancer.\nThis is critical.\nActually, 1931, Otto Warburg discovered that cancer cells have a broken metabolism.\nProved it.\nYou have a shadow of a doubt.\nWon a Nobel Prize.\nEven in the presence of oxygen, they ferment glucose, a very primitive, inefficient process\ncalled the Warburg effect.\nI wonder why they called it that.\nWhy?\nBecause their mitochondria are catastrophically damaged and cannot process and cannot perform\noxidative phosphorylation properly.\nSo by restoring systemic mitochondrial health, you create a metabolic environment that is\nhostile to cancer.\nIt makes the pathology an impossibility.\nHealthy mitochondria promote apoptosis, the cell death.\nThey force damage to pre-cancerous cells to self-destruct.\n2018 review in Cell Metabolism shows, proves that fixing the mitochondrial function is the most\npowerful anti-cancer strategy.\nNobody out there listening to this has ever heard that.\nThis doesn't cure cancer.\nIt attacks the root cause, the metabolic dysfunction that allowed it to initiate and\nthrive and exist in the first place.\nThe problem isn't the pathology.\nThe problem is that you got it because your system wasn't running right.\nAnd they know that.\nAnd you keep forgetting that, thinking you need a drug or a pill to make it go away.\nThe current medical paradigm is a concession speech.\nIt's a sick care system designed for a lifelong customer retention.\nThat's it.\nIt is the ultimate business model.\nAnd it demands that you stay because it makes sure you have no choice.\nIt waits for the power plant to blow up and then sells you a flashlight and a monthly subscription\nfor batteries.\nDoesn't fix the power plant.\nYou are, please listen to me, you guys.\nI want to go eat.\nYou are at a crossroads of your life and your health.\nWe have so much stacks and stacks, thousands and tens of thousands.\nIf you go, where are these research studies?\nI literally quote them in my podcasts and my actual studies.\nRemember, I'm doing all the work and all the Insta bros and bro science and Reddit forums\nare stealing my stuff.\nHow about you just give the doctor credit for actually the guy that does the work and\nspends his entire day making sure you have the answers.\nCause I frigging care.\nWe've got the peer reviewed research everywhere.\nWe have the molecular tools everywhere.\nWe have a physiological model that actually makes sense.\nIt's based on your biology, your physiology, the choices.\nIt's not between some drug or another drug.\nIt's between managing a dying system and engineering a healthy one that you are already predicated\nto have.\nYou guys have to stop accepting this decline and then funding your own decay thinking\nit's the only option you've got.\nI don't care where you buy your stuff as long as it's real.\nMost of the time it's not, by the way, most of these guys are selling crap.\nDo you know how I know?\nBecause I have people in my group that go, I was taking this and didn't do anything.\nAnd then I switched to elite biogenics and I went, holy crap.\nIt actually worked.\nStop buying it from your friend named Steve in the back of the gym because he happens\nto sell peptides.\nI'm going to say that's ridiculous.\nThat's absolutely ridiculous.\nBut you do you, bro.\nYou do you.\nThe power to change is not in some doctor's prescription and their pen or their digital\nor however they send it now.\nIt's in understanding the root of all health and what it is.\nAnd it's energy, not magical energy, energy, your ability to produce it.\nAnd the root of all energy is the same, the mitochondrion fix the mitochondria.\nWhat do you think happens?\nYou fix the person, you fix the biology, which means in order to fix the mitochondria, you\nsolve the three biological failures, solve systemic inflammation, solve insulin resistance,\nsolve the ATP to ATP shortage, because it's the by-product of the first two.\nIf you get what I just said in this entire podcast, in the last 10 seconds, even you'll\nget the error of symptom management is, but you have to be willing to accept that.\nAnd I know a lot of people aren't.\nI hope you got something out of this.\nI really do.\nNever miss.",
  "key_points": [],
  "action_items": [
    "And you get access to my live Q and a call I do every Monday in the black card",
    "You want to join apply at unlock the card",
    "I'm going to be very transparent",
    "2018 review in cell hallmarks of aging specifically places mitochondrial dysfunction at the very center\nof the diagram",
    "You have to have a sequence",
    "I'm not saying they're not needed if it's going to save your life, but 99% of the time,\nthey're not saving your life",
    "This is what it's called in order to force protons through",
    "Stabilizes the structure and then restores the one thing I said gets destroyed because\nit loses the charge dissipates the membrane potential, which is important for proton gradient\nand ATP synthase and all the things that need to occur",
    "If you take TB 500, which is proven to reverse fibrosis and solve damage to the\nmitochondria and you add SS 31, imagine what kind of wild stuff you could have that wouldn't\ncost you your heart or all the medication that they want to give you",
    "I have people, this is my favorite, people that didn't pay for something who want access\nto something because they feel they should get something yet haven't done anything that\nI've ever given me since"
  ],
  "people_mentioned": [],
  "topics": [
    "So",
    "Keep",
    "And",
    "Ill",
    "QA"
  ]
}